import React from 'react';

function UserGuide() {
  return (
    <div className="hoome">

      <div className='faq'>
        <h2>دليل المستخدم</h2>
        <div>
          <h3>التسجيل وإنشاء حساب</h3>
          <p>
            لإنشاء حساب جديد، انقر على زر "تسجيل" في أعلى الصفحة، ثم قم بتعبئة النموذج بمعلوماتك الشخصية مثل الاسم والبريد الإلكتروني وكلمة المرور. بعد إكمال النموذج، انقر على زر "إنشاء حساب" لإتمام العملية.
          </p>
        </div>
        <div>
          <h3>تسجيل الدخول</h3>
          <p>
            لتسجيل الدخول، انقر على زر "تسجيل الدخول" في أعلى الصفحة، ثم أدخل بريدك الإلكتروني وكلمة المرور التي استخدمتها عند إنشاء الحساب. بعد إدخال المعلومات، انقر على زر "تسجيل الدخول".
          </p>
        </div>
        <div>
          <h3>الإبلاغ عن مشكلة</h3>
          <p>
            بعد تسجيل الدخول، يمكنك الإبلاغ عن مشكلة بالنقر على زر "الإبلاغ عن مشكلة" في القائمة الرئيسية. قم بتعبئة النموذج بالمعلومات المطلوبة، مثل نوع المشكلة والوصف والصور (إذا كانت متاحة). بعد ذلك، انقر على زر "إرسال" لتقديم البلاغ.
          </p>
        </div>
        <div>
          <h3>متابعة حالة البلاغ</h3>
          <p>
            لمتابعة حالة البلاغات التي قمت بتقديمها، انتقل إلى صفحة "تقاريري" في ملفك الشخصي. يمكنك رؤية حالة كل بلاغ والتحديثات المتعلقة به.
          </p>
        </div>
        <div>
          <h3>تعديل معلومات الحساب</h3>
          <p>
            لتعديل معلومات حسابك، انتقل إلى صفحة "الملف الشخصي" من القائمة الرئيسية. يمكنك تعديل الاسم والبريد الإلكتروني وكلمة المرور وغيرها من المعلومات الشخصية. بعد إجراء التعديلات، انقر على زر "حفظ التغييرات".
          </p>
        </div>
        <div>
          <h3>التواصل مع الدعم الفني</h3>
          <p>
            إذا كنت تواجه مشكلة وتحتاج إلى مساعدة، يمكنك التواصل مع فريق الدعم الفني من خلال صفحة "الدعم الفني". املأ النموذج بالمعلومات المطلوبة وقدم وصفاً للمشكلة التي تواجهها، ثم انقر على زر "إرسال".
          </p>
        </div>
        <div>
          <h3>حذف الحساب</h3>
          <p>
            إذا كنت ترغب في حذف حسابك، انتقل إلى صفحة "الإعدادات" في ملفك الشخصي. انقر على زر "حذف الحساب" واتبع التعليمات. يرجى ملاحظة أن هذه العملية لا يمكن التراجع عنها.
          </p>
        </div>
      </div>
    </div>
  );
}

export default UserGuide;
