import React from 'react';
function Faq() {
  return (
    <div className="hoome">
      <div className='faq'>
        <h2>الأسئلة الشائعة</h2>
        <div>
          <h3>كيف يمكنني إنشاء حساب جديد؟</h3>
          <p>انقر على زر "تسجيل" في أعلى الصفحة، واملأ النموذج بمعلوماتك الشخصية، ثم انقر على "إنشاء حساب".</p>
        </div>
        <div>
          <h3>ماذا أفعل إذا نسيت كلمة المرور؟</h3>
          <p>انقر على "نسيت كلمة المرور" في صفحة تسجيل الدخول، وأدخل بريدك الإلكتروني لتلقي تعليمات إعادة تعيين كلمة المرور.</p>
        </div>
        <div>
          <h3>كيف يمكنني الإبلاغ عن مشكلة؟</h3>
          <p>بعد تسجيل الدخول، انتقل إلى صفحة "الإبلاغ عن مشكلة" واملأ النموذج المطلوب.</p>
        </div>
        <div>
          <h3>كيف يمكنني متابعة حالة البلاغ؟</h3>
          <p>يمكنك متابعة حالة البلاغ من خلال صفحة "تقاريري" في ملفك الشخصي.</p>
        </div>
        <div>
          <h3>كيف يمكنني تعديل معلومات الحساب؟</h3>
          <p>انتقل إلى صفحة "الملف الشخصي" وقم بتعديل المعلومات المطلوبة، ثم احفظ التغييرات.</p>
        </div>
        <div>
          <h3>كيف يمكنني التواصل مع الدعم الفني؟</h3>
          <p>يمكنك التواصل مع الدعم الفني من خلال صفحة "الدعم الفني" حيث يمكنك إرسال استفساراتك أو مشاكلك.</p>
        </div>
        <div>
          <h3>هل يمكنني حذف حسابي؟</h3>
          <p>نعم، يمكنك حذف حسابك من خلال صفحة "الإعدادات" في ملفك الشخصي. يرجى ملاحظة أن هذه العملية لا يمكن التراجع عنها.</p>
        </div>
        <div>
          <h3>هل يمكنني الإبلاغ عن مشكلة دون الكشف عن هويتي؟</h3>
          <p>نعم، يمكنك اختيار تقديم البلاغات بشكل مجهول من خلال تحديد خيار "مجهول" في نموذج الإبلاغ.</p>
        </div>
        <div>
          <h3>ما هي أنواع المشاكل التي يمكنني الإبلاغ عنها؟</h3>
          <p>يمكنك الإبلاغ عن أي نوع من المشاكل التي تواجهك، مثل الأعطال الفنية، المشاكل الأمنية، أو أي مشكلة أخرى تود الإبلاغ عنها.</p>
        </div>
      </div>
    </div>
  );
}

export default Faq;
