import React from 'react';
import { Link } from 'react-router-dom';

function CommunityForum() {
  return (
    <div className="hoome">
    <div className="faq">
      <h2>منتدى المجتمع</h2>
      <div>
        <h3>مرحبا بكم في منتدى المجتمع!</h3>
        <p>
          في منتدى المجتمع، يمكنكم التفاعل مع المستخدمين الآخرين، طرح الأسئلة، مشاركة الأفكار، والحصول على الدعم من المجتمع.
        </p>
      </div>
      <div>
        <h3>كيفية استخدام المنتدى</h3>
        <p>إليكم بعض النصائح حول كيفية استخدام المنتدى بفعالية:</p>
        <ul>
          <li>تصفح الفئات المختلفة للعثور على المواضيع التي تهمك.</li>
          <li>استخدم شريط البحث للعثور على المناقشات التي قد تكون ذات صلة بسؤالك.</li>
          <li>قبل إنشاء موضوع جديد، تحقق مما إذا كان قد تم مناقشة نفس الموضوع من قبل.</li>
          <li>كن محترمًا ومفيدًا عند التفاعل مع الآخرين.</li>
        </ul>
      </div>
      <div>
        <h3>إنشاء موضوع جديد</h3>
        <p>
          إذا كان لديك سؤال أو ترغب في بدء مناقشة جديدة، يمكنك إنشاء موضوع جديد من خلال النقر على زر "إنشاء موضوع جديد" في صفحة المنتدى.
        </p>
        <Link className='linkk' to={'/reports/create-report'}>إنشاء موضوع جديد</Link> 
      </div>
      <div>
        <h3>أحدث المناقشات</h3>
        <p>تصفح أحدث المناقشات التي تجري في المنتدى:</p>
        <ul>
          <li>
            <a href="/forum/discussion/1">ما هي أفضل الممارسات للإبلاغ عن مشكلة؟</a>
            <p>تم الإنشاء بواسطة المستخدم أحمد</p>
          </li>
          <li>
            <a href="/forum/discussion/2">كيفية متابعة حالة البلاغ الخاص بي؟</a>
            <p>تم الإنشاء بواسطة المستخدم ليلى</p>
          </li>
          <li>
            <a href="/forum/discussion/3">اقتراحات لتحسين الموقع</a>
            <p>تم الإنشاء بواسطة المستخدم علي</p>
          </li>
        </ul>
      </div>
    </div>
    </div>
  );
}

export default CommunityForum;
